BenchBnB/app/models/user.rb

  def self.find_by_credentials(un, pw)
    user = User.find_by(username: un)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "test"], ["LIMIT", 1]]